Repository: ZUGFeRD/quba-viewer
Catalog: 000resources/i18n/i18n-omegat.tmx
Source language: en
Languages: de

source: "structured" usually means XML (Quba supports parts of Oasis' UBL 2.1 and UN/CEFACTS Cross Industry Invoice, CII, 1.0/2016b) and "hybrid" means XML embedded in PDF
de: „strukturiert“ bedeutet in der Regel XML (Quba unterstützt Teile von Oasis‘ UBL 2.1 und UN/CEFACTS Cross Industry Invoice, CII, 1.0/2016b) und „hybrid“ bedeutet XML eingebettet in PDF

source: * Linux it will e.g. run on x64
de: * Linux, es läuft zB auf x64

source: * Windows it will run on x64 versions
de: * Windows läuft auf allen x64-Versionen

source: ** 10 and
de: ** 10 und

source: ** 11 as well as
de: ** 11 sowie

source: ** Server 2022 and
de: ** Server 2022 und

source: *No tax or legal advice can or will be given or should be deducted from using this software*.
de: *Aus der Nutzung dieser Software kann und wird keine Steuer- oder Rechtsberatung abgeleitet werden.*

source: *of a hybrid invoice like Factur-X*.
de: *einer Hybridrechnung wie Factur-X*.

source: = Quba Viewer Manual
de: = Quba Viewer-Handbuch

source: == Download and launch
de: == Herunterladen und starten

source: == Enterprise features
de: == Enterprise-Funktionen

source: == Preconditions
de: == Voraussetzungen

source: === Admin privileges
de: === Administratorrechte

source: === Alternatives
de: === Alternativen

source: === Command line arguments
de: === Befehlszeilenargumente

source: === Data protection
de: === Datenschutz

source: === Disabling Auto-Update
de: === Automatische Aktualisierung deaktivieren

source: === Display indexterm2:[Business Terms] (indexterm2:[BTs])
de: === Anzeige der indexterm2:[Business Terms] (indexterm2:[BTs])

source: === Installation on terminal servers/for all users
de: === Installation auf Terminalservern/für alle Benutzer

source: === License
de: === Lizenz

source: === Printing XML and PDF
de: === Drucken von XML und PDF

source: === Scope
de: === Umfang

source: === Search
de: === Suche

source: === Support
de: === Unterstützung

source: === Supported OSes
de: === Unterstützte Betriebssysteme

source: === Switching languages
de: === Sprachen wechseln

source: === Validation
de: === Validierung

source: ==== Archival
de: ==== Archivierung

source: ==== General
de: ==== Allgemein

source: ==== Hybrid invoices
de: ==== Hybridrechnungen

source: ==== Legal
de: ==== Rechtliches

source: A Mustangserver subscription may be interesting for some users but this is an entirely different and only very loosely integrated product and not the "Pro" version we're trying to sell.
de: Ein Mustangserver-Abonnement könnte für einige Benutzer interessant sein, aber dies ist ein völlig anderes und nur sehr lose integriertes Produkt und nicht die „Pro“-Version, die wir verkaufen möchten.

source: Actually please also report if you run it successfully on Windows server.
de: Bitte melden Sie auch, ob Sie es erfolgreich auf einem Windows-Server ausführen.

source: After an MSI-Installation Quba is by default started.
de: Nach einer MSI-Installation wird Quba standardmäßig gestartet.

source: Afterwards, switch into $PLUGINSDIR and extract again, this time the file app-64.7z.
de: Wechseln Sie anschließend in $PLUGINSDIR und extrahieren Sie erneut, diesmal die Datei app-64.7z.

source: As a matter of fact, there currently *is* no "Pro" or commercial version of Quba-Viewer.
de: Tatsächlich gibt es derzeit keine „Pro“- oder kommerzielle Version von Quba-Viewer.

source: Authors of e-invoices may use this software during development to check if the information in the XML mirrors the information in PDF correctly.
de: Autoren von E-Rechnungen können diese Software während der Entwicklung verwenden, um zu überprüfen, ob die Informationen im XML die Informationen im PDF korrekt widerspiegeln.

source: Based on Mustang, the independent link:https://github.com/OpenIndex/ZUGFeRD-Manager[ZUGFeRD-Manager] can also be used as a graphical user interface to write and validate Factur-X.
de: Basierend auf Mustang kann der unabhängige Link:https://github.com/OpenIndex/ZUGFeRD-Manager[ZUGFeRD-Manager] auch als grafische Benutzeroberfläche zum Schreiben und Validieren von Factur-X verwendet werden.

source: But coincidentially the scope covers most if not all kinds of e-invoices you have to be able to process in Germany (since 01.01.2025 according to link:https://www.recht.bund.de/bgbl/1/2024/108/regelungstext.pdf?__blob=publicationFile&v=2[Wachstumschancengesetz, p.23f, Art 23]).
de: Zufälligerweise deckt der Geltungsbereich die meisten, wenn nicht alle Arten von E-Rechnungen ab, die Sie in Deutschland verarbeiten können müssen (seit dem 01.01.2025 gemäß link:https://www.recht.bund.de/bgbl/1/2024/108/regelungstext.pdf?__blob=publicationFile&v=2 [Wachstumschancengesetz, S. 23f, Art. 23]).

source: But they may be obliged to use the XML-part even if a human readable PDF is available.
de: Sie sind jedoch möglicherweise verpflichtet, den XML-Teil zu verwenden, auch wenn ein für Menschen lesbares PDF verfügbar ist.

source: CII:: Business Term
de: CII:: Cross Industry Invoice

source: Currently (link:https://github.com/ZUGFeRD/quba-viewer/issues/135[#135]) Quba must be restarted after changing the language to english, french or german.
de: Derzeit (Link: https://github.com/ZUGFeRD/quba-viewer/issues/135[#135]) muss Quba nach dem Ändern der Sprache auf Englisch, Französisch oder Deutsch neu gestartet werden.

source: Even when validation is performed the data will be transmitted
de: Auch wenn eine Validierung durchgeführt wird, werden die Daten übermittelt

source: For anonymization you may try e.g. link:https://github.com/ZUGFeRD/einvoice-anonymizer[einvoice-anonymizer].
de: Zur Anonymisierung können Sie beispielsweise den Link https://github.com/ZUGFeRD/einvoice-anonymizer[einvoice-anonymizer] ausprobieren.

source: If there is connectivity, it may check for a new version on start, if not disabled.
de: Wenn eine Verbindung besteht, wird beim Start möglicherweise nach einer neuen Version gesucht, sofern dies nicht deaktiviert ist.

source: If you can absolutely not run any software you may still submit your invoices through online visualizers like
de: Wenn Sie absolut keine Software ausführen können, können Sie Ihre Rechnungen immer noch über Online-Visualisierer einreichen, wie

source: If you distribute software packages in your enterprise and you would like a silent install you can edit the MSI e.g. with link:http://www.instedit.com/[instedit] and remove the custom Action `runAfterFinish`.
de: Wenn Sie Softwarepakete in Ihrem Unternehmen verteilen und eine automatische Installation wünschen, können Sie die MSI beispielsweise mit dem Link: http://www.instedit.com/[instedit] bearbeiten und die benutzerdefinierte Aktion „runAfterFinish“ entfernen.

source: In particular for community support it may be required to anonymize your invoices which can be done using Andreas Starke's link:https://github.com/ZUGFeRD/einvoice-anonymizer[python script].
de: Insbesondere für den Community-Support kann es erforderlich sein, Ihre Rechnungen zu anonymisieren. Dies können Sie über den Link von Andreas Starke tun: https://github.com/ZUGFeRD/einvoice-anonymizer[Python-Skript].

source: In particular it may be a good idea to check the version you process pay, e.g. on the ZUGFeRD Entwicklertage 2025 an incident was mentioned where someone checked the visual PDF of a hybrid invoice, but then paid the fraudulent XML and lost 60,000€.
de: Insbesondere kann es sinnvoll sein, die Version zu überprüfen, mit der Sie Zahlungen verarbeiten. Beispielsweise wurde auf den ZUGFeRD-Entwicklertagen 2025 ein Vorfall erwähnt, bei dem jemand das visuelle PDF einer Hybridrechnung überprüfte, dann aber die betrügerische XML-Datei bezahlte und 60.000 € verlor.

source: Mustangs print feature originally had been designed with hybrid invoices in mind, i.e. Print|XML prints the visualization of the XML part and Print|PDF prints the human readable PDF part
de: Die Druckfunktion von Mustang wurde ursprünglich für hybride Rechnungen entwickelt, d. h. Print|XML druckt die Visualisierung des XML-Teils und Print|PDF druckt den menschenlesbaren PDF-Teil

source: No usage data whatsoever is collected.
de: Es werden keinerlei Nutzungsdaten erhoben.

source: On link:https://github.com/ZUGFeRD/quba-viewer/releases[Github] you will find a .indexterm2:[MSI]-releases of this software.
de: Unter link:https://github.com/ZUGFeRD/quba-viewer/releases[Github] finden Sie eine .indexterm2:[MSI]-Version dieser Software.

source: Other great work is e.g. the link:https://jcthiele.github.io/OpenXRechnungToolbox/[Open XRechnung Toolbox], which is, like Quba, originally based on the link:https://github.com/itplr-kosit/xrechnung-visualization/[xrechnung-visualization], but does not even attempt to cover Factur-X Extended features.
de: Eine weitere großartige Arbeit ist beispielsweise der Link:https://jcthiele.github.io/OpenXRechnungToolbox/[Open XRechnung Toolbox], der wie Quba ursprünglich auf dem Link:https://github.com/itplr-kosit/xrechnung-visualization/[xrechnung-visualization] basiert, aber nicht einmal versucht, die erweiterten Funktionen von Factur-X abzudecken.

source: Our sister project link:https://www.mustangproject.org/[Mustang] contains a command line utility with which you can convert to PDF, or validate e-invoices offline.
de: Der Link zu unserem Schwesterprojekt: https://www.mustangproject.org/[Mustang] enthält ein Befehlszeilenprogramm, mit dem Sie in PDF konvertieren oder E-Rechnungen offline validieren können.

source: Please note that as with all open-source software we do not guarantee anything, in particularly not that Quba works at all, displays correct or complete information, or causes no harm to your computer.
de: Bitte beachten Sie, dass wir wie bei jeder Open-Source-Software keinerlei Garantie dafür übernehmen, dass Quba überhaupt funktioniert, richtige oder vollständige Informationen anzeigt oder Ihrem Computer keinen Schaden zufügt.

source: Please report if it runs on other platforms as well.
de: Bitte melden Sie, ob es auch auf anderen Plattformen läuft.

source: Quba as software packages certified by your team.
de: Quba als von Ihrem Team zertifizierte Softwarepakete verteilen.

source: Quba-Viewer is a open-source Mac-OS, Windows and Linux software in english, french and german to display structured and hybrid electronic invoices offline.
de: Quba-Viewer ist eine Open-Source-Software für Mac OS, Windows und Linux in Englisch, Französisch und Deutsch zum Offline-Anzeigen strukturierter und hybrider elektronischer Rechnungen.

source: Quba-viewer is a offline application which does not require internet connectivity.
de: Quba-Viewer ist eine Offline-Anwendung, die keine Internetverbindung erfordert.

source: Recipients are usually not oblidged to do so.
de: Eine Verpflichtung hierzu besteht für die Empfänger in der Regel nicht.

source: SSL-encrypted to a german server and the invoice XML, PDF source and PDF output files will be deleted after transmission.
de: SSL-verschlüsselt an einen deutschen Server und die Rechnungs-XML-, PDF-Quell- und PDF-Ausgabedateien werden nach der Übertragung gelöscht.

source: Statistical records
de: Statistische Aufzeichnungen

source: Technically this requires submission of your IP address to a Github server.
de: Technisch erfordert dies die Übermittlung Ihrer IP-Adresse an einen Github-Server.

source: The fact that you download Quba may be tracked anonymously for
de: Die Tatsache, dass Sie Quba herunterladen, kann anonym verfolgt werden für

source: The validation feature will present you a extended data protection agreement: it currently requires a submission of the whole invoice to a server in the internet.
de: Mit der Validierungsfunktion erhalten Sie eine erweiterte Datenschutzerklärung: Sie erfordert aktuell die Übermittlung der gesamten Rechnung an einen Server im Internet.

source: Then start quba.exe in the resulting directory.
de: Starten Sie anschließend quba.exe im resultierenden Verzeichnis.

source: There is not yet a conversion feature from XML to PDF so the Print|PDF feature will be disabled if no PDF is available (e.g. for XRechnung).
de: Eine Konvertierungsfunktion von XML nach PDF ist noch nicht vorhanden, daher wird die Funktion Drucken|PDF deaktiviert, wenn kein PDF verfügbar ist (z. B. für XRechnung).

source: This can be installed for all users the following command:
de: Dies kann für alle Benutzer mit folgendem Befehl installiert werden:

source: This can be problematic e.g. when distributing access to the software on a terminal server.
de: Dies kann beispielsweise bei der Verteilung des Zugriffs auf die Software auf einem Terminalserver problematisch sein.

source: This may be useful e.g. if you distribute
de: Dies kann beispielsweise nützlich sein, wenn Sie

source: UBL:: Business Term
de: UBL:: Universal Business Language

source: Under
de: Unter

source: Unfortunately there no dedicated Mime-Type or file extension has yet been assigned to electronic invoices, i.e. you would have to make it a default viewer for *.xml and/or *.pdf.
de: Leider ist den elektronischen Rechnungen bisher kein dedizierter Mime-Typ bzw. keine dedizierte Dateierweiterung zugewiesen, d. h. Sie müssten es als Standard-Viewer für *.xml und/oder *.pdf festlegen.

source: Unfortunately, Quba does yet help you with these obligations.
de: Leider unterstützt Sie Quba bei diesen Verpflichtungen noch nicht.

source: Unless a commercial contract has been agreed upon of course no
de: Sofern kein Handelsvertrag abgeschlossen wurde,

source: Upon receipt of your first e-invoice you may be subject to additional digital archival obligation like in the link:https://ao.bundesfinanzministerium.de/ao/2023/Anhaenge/BMF-Schreiben-und-gleichlautende-Laendererlasse/Anhang-64/inhalt.html[german GoBD].
de: Mit Erhalt Ihrer ersten E-Rechnung unterliegen Sie möglicherweise einer zusätzlichen digitalen Archivierungspflicht wie im Link:https://ao.bundesfinanzministerium.de/ao/2023/Anhaenge/BMF-Schreiben-und-gleichlautende-Laendererlasse/Anhang-64/inhalt.html[deutsche GoBD].

source: Use `CTRL+F` to open a prompt to indexterm2:[search] for terms (or, if display is enabled, for BTs) in your invoices.
de: Verwenden Sie „STRG+F“, um eine Eingabeaufforderung zum Indexieren von Term2:[Suche] nach Begriffen (oder, wenn die Anzeige aktiviert ist, nach BTs) in Ihren Rechnungen zu öffnen.

source: Using File|Show IDs you can display the BT-IDs next to the textfields with the output when loading the next invoice.
de: Über Datei|IDs anzeigen können Sie ab der nächsten geladenen Rechnung die BT-IDs neben den Textfeldern anzeigen.

source: Usually, on Windows Quba is installed only for the current user.
de: Normalerweise wird Quba unter Windows nur für den aktuellen Benutzer installiert.

source: We at least cover the EN16931 part of UBL and CII, thus, XRechnung.
de: Wir decken zumindest den EN16931-Teil von UBL und CII ab, also XRechnung.

source: We casually try to keep an archive of old Quba-Viewer versions we released but if you base critical decisions on certain software it may be a good idea to archive this software yourself.
de: Wir versuchen nebenbei, ein Archiv der alten von uns veröffentlichten Quba-Viewer-Versionen zu führen. Wenn Sie jedoch kritische Entscheidungen auf der Grundlage bestimmter Software treffen, ist es möglicherweise eine gute Idee, diese Software selbst zu archivieren.

source: We do not monitor, evaluate or in any other way use data from these update checks.
de: Eine Überwachung, Auswertung oder sonstige Nutzung der Daten aus diesen Aktualitätsprüfungen durch uns erfolgt nicht.

source: We try to support Factur-X 1/ZUGFeRD 2.x as good as possible even in the "Extended" profile and we do support Order-X.
de: Wir versuchen Factur-X 1/ZUGFeRD 2.x auch im Profil „Extended“ so gut wie möglich zu unterstützen und wir unterstützen Order-X.

source: We will not use any of the data and the files will be deleted immediately after the request but we may statistically and anonymously log that there was a request and unless you have a subscription to Mustangserver you have no ADV with us and should submit only test or anonymized invoices.
de: Wir verwenden keine der Daten und die Dateien werden unmittelbar nach der Anfrage gelöscht. Wir können jedoch statistisch und anonym protokollieren, dass eine Anfrage gestellt wurde. Sofern Sie kein Abonnement für Mustangserver haben, haben Sie bei uns keinen ADV und sollten nur Testrechnungen oder anonymisierte Rechnungen einreichen.

source: You can obtain community support via link:https://github.com/ZUGFeRD/quba-viewer/[Github] (to raise issues or submit improvements) and the generic "mailing list" i.e. the link:https://groups.google.com/g/zugferd[Google Group] (e.g. for e-invoice questions), as well as obtain commercial support from link:http://www.mustangproject.org/support/[usegroup via Mustangproject].
de: Sie können Community-Support über den Link:https://github.com/ZUGFeRD/quba-viewer/[Github] (um Probleme zu melden oder Verbesserungen einzureichen) und die allgemeine „Mailingliste“, d. h. den Link:https://groups.google.com/g/zugferd[Google Group] (z. B. für Fragen zu elektronischen Rechnungen), erhalten. Kommerziellen Support erhalten Sie außerdem über den Link:http://www.mustangproject.org/support/[usegroup via Mustangproject].

source: You can pass the name of a file to be opened as argument to Quba, this allows you to install Quba as default viewer for those files on most operating systems.
de: Sie können den Namen einer zu öffnenden Datei als Argument an Quba übergeben. Dadurch können Sie Quba auf den meisten Betriebssystemen als Standard-Viewer für diese Dateien installieren.

source: You can run the Windows version without requiring admin privileges by extracting the exe (quba-setup...exe) using
de: Sie können die Windows-Version ohne Administratorrechte ausführen, indem Sie die EXE-Datei (quba-setup...exe) mit

source: You can use this open source software free of charge, also commercially, as well as for derivative works under the conditions of the
de: Sie können diese Open Source-Software kostenlos nutzen, auch kommerziell, sowie für abgeleitete Werke unter den Bedingungen der

source: as of when how many validations of which profile and hash
de: ab wann wie viele Validierungen von welchem Profil und Hash

source: data processing agreement or service level agreements are in place but link:https://www.mustangproject.org/files/wartungsvertrag_muster_EN.pdf[this] is how they look for Mustangserver.
de: Es liegen zwar ein Auftragsverarbeitungsvertrag oder Service Level Agreements vor, aber Link:https://www.mustangproject.org/files/wartungsvertrag_muster_EN.pdf[so] sehen sie für Mustangserver aus.

source: files, i.e. Factur-X/ZUGFeRD.
de: Dateien, zB Factur-X/ZUGFeRD.

source: has been performed with which results may be kept.
de: durchgeführt, mit denen die Ergebnisse festgehalten werden können.

source: link:https://www.elster.de/eportal/e-rechnung[Elster] (also based on the xrechnung-visualization).
de: Link:https://www.elster.de/eportal/e-rechnung[Elster] (auch basierend auf der xrechnung-visualisierung).

source: quba-viewer/files/ e.g. contains
de: quba-viewer/files/ zB enthält

source: set `performOnStartup=false` in
de: setzen Sie `performOnStartup=false` in

source: statistical purposes as per site privacy.
de: für statistische Zwecke gemäß der Datenschutzrichtlinie der Website.

source: technical/organisational measures,
de: technische/organisatorische Maßnahmen,

source: the open source software link:https://www.7-zip.org/[7-zip].
de: Link zur Open-Source-Software: https://www.7-zip.org/[7-zip].

source: to disable the check at each startup of the software if new versions exist.
de: um die Prüfung bei jedem Start der Software zu deaktivieren, ob neue Versionen vorhanden sind.
